[Survived] BlockStatement
src/components/Layout.jsx:7:22
 //import Header from './Header'
 
 
-const Layout = () => {
-  return (<>
-    {/* <Header /> */}
-    <div>
-       <Main />
-    </div>
-    <Footer />
-  </>
-  )
-}
+const Layout = () => {}
 
 export default Layout
