[Survived] ObjectLiteral
src/pages/Contact.jsx:10:50
 // ... (other imports and code)
 
 const Contact = () => {
-  const [profileData, setProfileData] = useState({
-    address: '',
-    collegeName: '',
-    degree: '',
-    joiningYear: '',
-    passingYear: '',
-    joiningDate: '',
-    leavingDate: '',
-    position: '',
-    organizationId: '',
-    contactNumber: '',
-    email: '',
-  });
+  const [profileData, setProfileData] = useState({});
 
   const changeProfileData = (e) => {

[Survived] StringLiteral
src/pages/Contact.jsx:12:18
 const Contact = () => {
   const [profileData, setProfileData] = useState({
     address: '',
-    collegeName: '',
+    collegeName: "Stryker was here!",
     degree: '',
     joiningYear: '',

[Survived] StringLiteral
src/pages/Contact.jsx:13:13
   const [profileData, setProfileData] = useState({
     address: '',
     collegeName: '',
-    degree: '',
+    degree: "Stryker was here!",
     joiningYear: '',
     passingYear: '',

[Survived] StringLiteral
src/pages/Contact.jsx:14:18
     address: '',
     collegeName: '',
     degree: '',
-    joiningYear: '',
+    joiningYear: "Stryker was here!",
     passingYear: '',
     joiningDate: '',

[Survived] StringLiteral
src/pages/Contact.jsx:18:15
     passingYear: '',
     joiningDate: '',
     leavingDate: '',
-    position: '',
+    position: "Stryker was here!",
     organizationId: '',
     contactNumber: '',

[Survived] StringLiteral
src/pages/Contact.jsx:21:12
     position: '',
     organizationId: '',
     contactNumber: '',
-    email: '',
+    email: "Stryker was here!",
   });
 

[Survived] BlockStatement
src/pages/Contact.jsx:24:36
     email: '',
   });
 
-  const changeProfileData = (e) => {
-    // console.log(name,"  ",value)
-    const { name, value } = e.target;
-    setProfileData(prevData => ({
-        ...prevData,
-        [name]: value
-    }));
-};
+  const changeProfileData = (e) => {};
 const [ notification, setNotification ] = useState(null)
 const [ notificationType, setNotificationType ] = useState(null)

[Survived] ArrowFunction
src/pages/Contact.jsx:27:20
   const changeProfileData = (e) => {
     // console.log(name,"  ",value)
     const { name, value } = e.target;
-    setProfileData(prevData => ({
-        ...prevData,
-        [name]: value
-    }));
+    setProfileData(() => undefined);
 };
 const [ notification, setNotification ] = useState(null)

[Survived] ArrayDeclaration
src/pages/Contact.jsx:45:54
   }, 3000)
 }
 
-  const [organizations, setOrganizations] = useState([]);
+  const [organizations, setOrganizations] = useState(["Stryker was here"]);
   const accessToken = JSON.parse(localStorage.getItem('loggedInUser')).access_token;
 

[Survived] BlockStatement
src/pages/Contact.jsx:49:35
   const accessToken = JSON.parse(localStorage.getItem('loggedInUser')).access_token;
 
   useEffect(() => {
-    const fetchData = async () => {
-      
-
-      try {
-        const response = await axios.get('/api/v1/organisations', {
-          headers: {
-            'access-control-allow-origin': '*',
-            Authorization: `Bearer ${accessToken}`,
-          },
-        });
-
-        setOrganizations(response.data);
-
-        // Assuming the organizationId is a property in your profileData state,
-        // set the default organizationId to the first organization in the list
-        if (response.data.length > 0) {
-          setProfileData((prevProfileData) => ({
-            ...prevProfileData,
-            organizationId: response.data[0].id,
-          }));
-        }
-      } catch (error) {
-        console.error('Error fetching organizations:', error);
-      }
-    };
+    const fetchData = async () => {};
 
     fetchData();

[Survived] BlockStatement
src/pages/Contact.jsx:52:11
     const fetchData = async () => {
       
 
-      try {
-        const response = await axios.get('/api/v1/organisations', {
-          headers: {
-            'access-control-allow-origin': '*',
-            Authorization: `Bearer ${accessToken}`,
-          },
-        });
-
-        setOrganizations(response.data);
-
-        // Assuming the organizationId is a property in your profileData state,
-        // set the default organizationId to the first organization in the list
-        if (response.data.length > 0) {
-          setProfileData((prevProfileData) => ({
-            ...prevProfileData,
-            organizationId: response.data[0].id,
-          }));
-        }
-      } catch (error) {
+      try {} catch (error) {
         console.error('Error fetching organizations:', error);
       }

[Survived] StringLiteral
src/pages/Contact.jsx:55:44
       try {
         const response = await axios.get('/api/v1/organisations', {
           headers: {
-            'access-control-allow-origin': '*',
+            'access-control-allow-origin': "",
             Authorization: `Bearer ${accessToken}`,
           },

[Survived] StringLiteral
src/pages/Contact.jsx:56:28
         const response = await axios.get('/api/v1/organisations', {
           headers: {
             'access-control-allow-origin': '*',
-            Authorization: `Bearer ${accessToken}`,
+            Authorization: ``,
           },
         });

[Survived] EqualityOperator
src/pages/Contact.jsx:64:13
 
         // Assuming the organizationId is a property in your profileData state,
         // set the default organizationId to the first organization in the list
-        if (response.data.length > 0) {
+        if (response.data.length <= 0) {
           setProfileData((prevProfileData) => ({
             ...prevProfileData,

[Survived] BlockStatement
src/pages/Contact.jsx:64:39
 
         // Assuming the organizationId is a property in your profileData state,
         // set the default organizationId to the first organization in the list
-        if (response.data.length > 0) {
-          setProfileData((prevProfileData) => ({
-            ...prevProfileData,
-            organizationId: response.data[0].id,
-          }));
-        }
+        if (response.data.length > 0) {}
       } catch (error) {
         console.error('Error fetching organizations:', error);

[Survived] ArrowFunction
src/pages/Contact.jsx:65:26
         // Assuming the organizationId is a property in your profileData state,
         // set the default organizationId to the first organization in the list
         if (response.data.length > 0) {
-          setProfileData((prevProfileData) => ({
-            ...prevProfileData,
-            organizationId: response.data[0].id,
-          }));
+          setProfileData(() => undefined);
         }
       } catch (error) {

[Survived] BlockStatement
src/pages/Contact.jsx:70:23
             organizationId: response.data[0].id,
           }));
         }
-      } catch (error) {
-        console.error('Error fetching organizations:', error);
-      }
+      } catch (error) {}
     };
 

[Survived] ArrayDeclaration
src/pages/Contact.jsx:76:6
     };
 
     fetchData();
-  }, []); // Empty dependency array to run the effect only once when the component mounts
+  }, ["Stryker was here"]); // Empty dependency array to run the effect only once when the component mounts
 
   // Handle Contact Form Submission

[Survived] ObjectLiteral
src/pages/Contact.jsx:101:36
       };
 
       console.log("Data ", data);
-      const response = await axios({
-        method: 'post',
-        url: `/api/v1/student/add`,
-        data,
-        headers: {
-          "Content-Type": 'application/json',
-          'Access-Control-Allow-Origin': '*',
-           Authorization: `Bearer ${accessToken}`
-        },
-      });
+      const response = await axios({});
       notificationHandler(`Registration Successful`, 'Success');
       console.log('Contact Form Submitted:', response.data);

[Survived] StringLiteral
src/pages/Contact.jsx:111:54
            Authorization: `Bearer ${accessToken}`
         },
       });
-      notificationHandler(`Registration Successful`, 'Success');
+      notificationHandler(`Registration Successful`, "");
       console.log('Contact Form Submitted:', response.data);
 

[Survived] BlockStatement
src/pages/Contact.jsx:115:21
       console.log('Contact Form Submitted:', response.data);
 
       // Add your logic for handling the response, such as showing a success message, updating state, etc.
-    } catch (error) {
-      notificationHandler(`Alumni is Already Registered`, 'Failure');
-      console.error('Error submitting contact form:', error);
-
-
-      // Handle specific error cases, if needed
-    }
+    } catch (error) {}
   };
 

[Survived] StringLiteral
src/pages/Contact.jsx:116:27
 
       // Add your logic for handling the response, such as showing a success message, updating state, etc.
     } catch (error) {
-      notificationHandler(`Alumni is Already Registered`, 'Failure');
+      notificationHandler(``, 'Failure');
       console.error('Error submitting contact form:', error);
 

[Survived] StringLiteral
src/pages/Contact.jsx:117:21
       // Add your logic for handling the response, such as showing a success message, updating state, etc.
     } catch (error) {
       notificationHandler(`Alumni is Already Registered`, 'Failure');
-      console.error('Error submitting contact form:', error);
+      console.error("", error);
 
 

[Survived] ArrowFunction
src/pages/Contact.jsx:187:25
               name='organizationId'
               className="form-control"
               value={profileData.organizationId}
-              onChange={(e) =>
-                setProfileData({
-                  ...profileData,
-                  organizationId: e.target.value,
-                })
+              onChange={() => undefined
               }
             >

[Survived] ArrowFunction
src/pages/Contact.jsx:194:34
                 })
               }
             >
-              {organizations.map((org) => (
-                <option key={org.id} value={org.id}>
-                  {org.name}
-                </option>
-              ))}
+              {organizations.map(() => undefined)}
             </select>
           </div>
