[Survived] StringLiteral
src/pages/LoginForm.js:10:46
 const LoginForm = ({ startLogin }) => {
   // States for tracking form input which are the email address and password
   const [ email, setEmail ] = useState('')
-  const [ password, setPassword ] = useState('')
+  const [ password, setPassword ] = useState("Stryker was here!")
 
   // onSubmit event handler of this form

[Killed] BlockStatement
src/pages/LoginForm.js:13:34
   const [ password, setPassword ] = useState('')
 
   // onSubmit event handler of this form
-  const handleLogin = (event) => {
-    // Preventing default submission of the form to the action attribute URL
-    event.preventDefault()
-
-    const credentials = {
-      email, password
-    }
-
-    // Calling startLogin with the provided credentials that will make a call to the backend
-    startLogin(credentials)
-
-    // Reset the form state, i.e. the text that's on the username and password text boxes to empty strings
-    setEmail('')
-    setPassword('')
-  };
+  const handleLogin = (event) => {};
 
 
killedBy: LoginForm Component calls startLogin with the correct credentials on form submission
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ObjectLiteral
src/pages/LoginForm.js:17:25
     // Preventing default submission of the form to the action attribute URL
     event.preventDefault()
 
-    const credentials = {
-      email, password
-    }
+    const credentials = {}
 
     // Calling startLogin with the provided credentials that will make a call to the backend
killedBy: LoginForm Component calls startLogin with the correct credentials on form submission
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
-   "password": "password123",
