[Survived] BlockStatement
src/pages/Main.js:22:50
   const [ notification, setNotification ] = useState(null)
   const [ notificationType, setNotificationType ] = useState(null)
 
-  const notificationHandler = (message, type) => {
-    setNotification(message)
-    setNotificationType(type)
-
-    setTimeout(() => {
-      setNotificationType(null)
-      setNotification(null)
-    }, 3000)
-  }
+  const notificationHandler = (message, type) => {}
 
   const handleLogin = async(credentials) => {

[Survived] BlockStatement
src/pages/Main.js:32:45
     }, 3000)
   }
 
-  const handleLogin = async(credentials) => {
-    try {
-        const userObject = await loginService.login(credentials)
-        setUser(userObject)
-        window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
-        
-        notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
-       // navigate('/search');
-      }
-      catch (exception) {
-        notificationHandler(`Log in failed, check username and password entered`, 'error')
-      }
-    // Update the state to indicate that the user is logged in
-    
-  };
+  const handleLogin = async(credentials) => {};
   useEffect(() => {
     const loggedInUser = window.localStorage.getItem('loggedInUser')

[Survived] BlockStatement
src/pages/Main.js:33:9
   }
 
   const handleLogin = async(credentials) => {
-    try {
-        const userObject = await loginService.login(credentials)
-        setUser(userObject)
-        window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
-        
-        notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
-       // navigate('/search');
-      }
+    try {}
       catch (exception) {
         notificationHandler(`Log in failed, check username and password entered`, 'error')

[Survived] StringLiteral
src/pages/Main.js:36:37
     try {
         const userObject = await loginService.login(credentials)
         setUser(userObject)
-        window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
+        window.localStorage.setItem("", JSON.stringify(userObject))
         
         notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')

[Survived] StringLiteral
src/pages/Main.js:38:83
         setUser(userObject)
         window.localStorage.setItem('loggedInUser', JSON.stringify(userObject))
         
-        notificationHandler(`Logged in successfully as ${userObject.first_name}`, 'success')
+        notificationHandler(`Logged in successfully as ${userObject.first_name}`, "")
        // navigate('/search');
       }

[Survived] StringLiteral
src/pages/Main.js:42:83
        // navigate('/search');
       }
       catch (exception) {
-        notificationHandler(`Log in failed, check username and password entered`, 'error')
+        notificationHandler(`Log in failed, check username and password entered`, "")
       }
     // Update the state to indicate that the user is logged in

[Survived] BlockStatement
src/pages/Main.js:47:19
     // Update the state to indicate that the user is logged in
     
   };
-  useEffect(() => {
-    const loggedInUser = window.localStorage.getItem('loggedInUser')
-    if (loggedInUser)
-      setUser(JSON.parse(loggedInUser))
-  }, [])
+  useEffect(() => {}, [])
 
   return (

[Survived] LogicalOperator
src/pages/Main.js:61:12
       
 
           
-          {user === null && (
-            <div className='text-center page-header p-10 regular-text-shadow regular-shadow'>
-              <div className='display-14 font-weight-bold' style={{ color: '#fff', backgroundColor: 'black', padding: '10px', borderRadius: '5px' ,paddingLeft:'42%',fontSize:'50px'}}>
-                Academia
-              </div>
-            </div>
-          )}
+          {user === null || <div className='text-center page-header p-10 regular-text-shadow regular-shadow'>
+              <div className='display-14 font-weight-bold' style={{
+    color: '#fff',
+    backgroundColor: 'black',
+    padding: '10px',
+    borderRadius: '5px',
+    paddingLeft: '42%',
+    fontSize: '50px'
+  }}>
+                Academia
+              </div>
+            </div>}
 
           {

[Survived] EqualityOperator
src/pages/Main.js:61:12
       
 
           
-          {user === null && (
+          {user !== null && (
             <div className='text-center page-header p-10 regular-text-shadow regular-shadow'>
               <div className='display-14 font-weight-bold' style={{ color: '#fff', backgroundColor: 'black', padding: '10px', borderRadius: '5px' ,paddingLeft:'42%',fontSize:'50px'}}>

[Survived] StringLiteral
src/pages/Main.js:63:141
           
           {user === null && (
             <div className='text-center page-header p-10 regular-text-shadow regular-shadow'>
-              <div className='display-14 font-weight-bold' style={{ color: '#fff', backgroundColor: 'black', padding: '10px', borderRadius: '5px' ,paddingLeft:'42%',fontSize:'50px'}}>
+              <div className='display-14 font-weight-bold' style={{ color: '#fff', backgroundColor: 'black', padding: '10px', borderRadius: "" ,paddingLeft:'42%',fontSize:'50px'}}>
                 Academia
               </div>

[Survived] StringLiteral
src/pages/Main.js:63:160
           
           {user === null && (
             <div className='text-center page-header p-10 regular-text-shadow regular-shadow'>
-              <div className='display-14 font-weight-bold' style={{ color: '#fff', backgroundColor: 'black', padding: '10px', borderRadius: '5px' ,paddingLeft:'42%',fontSize:'50px'}}>
+              <div className='display-14 font-weight-bold' style={{ color: '#fff', backgroundColor: 'black', padding: '10px', borderRadius: '5px' ,paddingLeft:"",fontSize:'50px'}}>
                 Academia
               </div>

[Survived] ConditionalExpression
src/pages/Main.js:71:13
 
           {
             /* Show Login form when no login has happened */
-            user === null && 
-            <LoginForm startLogin={handleLogin}/>
+            false
           }
           

[Survived] EqualityOperator
src/pages/Main.js:71:13
 
           {
             /* Show Login form when no login has happened */
-            user === null && 
+            user !== null && 
             <LoginForm startLogin={handleLogin}/>
           }

[Survived] LogicalOperator
src/pages/Main.js:75:12
             <LoginForm startLogin={handleLogin}/>
           }
           
-          {user && (
-             <div>
-               <Header user={user} setUser={setUser}/>
-               <Search />
-               
-               {/* <Profile /> */}
-               {/* <Notifications /> */}
-               
-             </div>
-           )}
+          {user || <div>
+               <Header user={user} setUser={setUser} />
+               <Search />
+               
+               {/* <Profile /> */}
+               {/* <Notifications /> */}
+               
+             </div>}
            <Notification notification={notification} type={notificationType} />
       </main>

[Survived] ConditionalExpression
src/pages/Main.js:75:12
             <LoginForm startLogin={handleLogin}/>
           }
           
-          {user && (
-             <div>
-               <Header user={user} setUser={setUser}/>
-               <Search />
-               
-               {/* <Profile /> */}
-               {/* <Notifications /> */}
-               
-             </div>
-           )}
+          {false}
            <Notification notification={notification} type={notificationType} />
       </main>
