[Survived] StringLiteral
src/pages/Search.jsx:12:38
 
 const Search = () => {
   const [grad_year, setGYear] = useState('');
-  const [fname, setFname] = useState('');
+  const [fname, setFname] = useState("Stryker was here!");
   //const [lname, setLname] = useState('');
   const [alumniData, setAlumniData] = useState([]);

[Survived] BooleanLiteral
src/pages/Search.jsx:15:36
   const [fname, setFname] = useState('');
   //const [lname, setLname] = useState('');
   const [alumniData, setAlumniData] = useState([]);
-  const [show, setShow] = useState(false);
+  const [show, setShow] = useState(true);
   const [noRecord, setNoRecord] = useState(false);
   const [propertyVal, setPropertyVal] = useState(1);

[Survived] BooleanLiteral
src/pages/Search.jsx:16:44
   //const [lname, setLname] = useState('');
   const [alumniData, setAlumniData] = useState([]);
   const [show, setShow] = useState(false);
-  const [noRecord, setNoRecord] = useState(false);
+  const [noRecord, setNoRecord] = useState(true);
   const [propertyVal, setPropertyVal] = useState(1);
   const [register, setRegister] = useState(false);

[Survived] BooleanLiteral
src/pages/Search.jsx:18:44
   const [show, setShow] = useState(false);
   const [noRecord, setNoRecord] = useState(false);
   const [propertyVal, setPropertyVal] = useState(1);
-  const [register, setRegister] = useState(false);
+  const [register, setRegister] = useState(true);
   const [showContactForm, setShowContactForm] = useState(false);
   //const [uml, showUML] = useState(false);

[Survived] BooleanLiteral
src/pages/Search.jsx:19:58
   const [noRecord, setNoRecord] = useState(false);
   const [propertyVal, setPropertyVal] = useState(1);
   const [register, setRegister] = useState(false);
-  const [showContactForm, setShowContactForm] = useState(false);
+  const [showContactForm, setShowContactForm] = useState(true);
   //const [uml, showUML] = useState(false);
   //const navigate = useNavigate();

[Survived] BlockStatement
src/pages/Search.jsx:23:40
   //const [uml, showUML] = useState(false);
   //const navigate = useNavigate();
 
-  const handleChangeGYear = (event) => {
-    setGYear(event.target.value);
-  };
+  const handleChangeGYear = (event) => {};
 
   const handleChangeFName = (event) => {

[Survived] BlockStatement
src/pages/Search.jsx:27:40
     setGYear(event.target.value);
   };
 
-  const handleChangeFName = (event) => {
-    setFname(event.target.value);
-  };
+  const handleChangeFName = (event) => {};
 
   const getAlumniDetails = async () => {

[Survived] ObjectLiteral
src/pages/Search.jsx:36:108
       const token = JSON.parse(localStorage.getItem('loggedInUser')).access_token;
       console.log("token: " + token);
   
-      const response = await axios.get(`/api/v1/student/search?graduationYear=${grad_year}&name=${fname}`, {
-        headers: {
-          "access-control-allow-origin": "*",
-          Authorization: `Bearer ${token}`
-        }
-      });
+      const response = await axios.get(`/api/v1/student/search?graduationYear=${grad_year}&name=${fname}`, {});
       let arr = []
       console.log("Alumni Data: ","response: ", response.data.length);

[Survived] StringLiteral
src/pages/Search.jsx:36:40
       const token = JSON.parse(localStorage.getItem('loggedInUser')).access_token;
       console.log("token: " + token);
   
-      const response = await axios.get(`/api/v1/student/search?graduationYear=${grad_year}&name=${fname}`, {
+      const response = await axios.get(``, {
         headers: {
           "access-control-allow-origin": "*",

[Survived] StringLiteral
src/pages/Search.jsx:38:42
   
       const response = await axios.get(`/api/v1/student/search?graduationYear=${grad_year}&name=${fname}`, {
         headers: {
-          "access-control-allow-origin": "*",
+          "access-control-allow-origin": "",
           Authorization: `Bearer ${token}`
         }

[Survived] EqualityOperator
src/pages/Search.jsx:44:23
       });
       let arr = []
       console.log("Alumni Data: ","response: ", response.data.length);
-      for (let i = 0; i < response.data.length; i++) {
+      for (let i = 0; i >= response.data.length; i++) {
         // console.log("Inside Loop ",response.data[i]);
         arr.push(response.data[i]);

[Survived] BlockStatement
src/pages/Search.jsx:44:54
       });
       let arr = []
       console.log("Alumni Data: ","response: ", response.data.length);
-      for (let i = 0; i < response.data.length; i++) {
-        // console.log("Inside Loop ",response.data[i]);
-        arr.push(response.data[i]);
-      }
+      for (let i = 0; i < response.data.length; i++) {}
   
       const data = response.data[0];

[Survived] EqualityOperator
src/pages/Search.jsx:52:25
       const data = response.data[0];
       setAlumniData(arr);
       console.log("response: ",data);
-      if (alumniData && arr.length !== 0) {
+      if (alumniData && arr.length === 0) {
         console.log("record exist status",noRecord);
         

[Survived] ConditionalExpression
src/pages/Search.jsx:52:11
       const data = response.data[0];
       setAlumniData(arr);
       console.log("response: ",data);
-      if (alumniData && arr.length !== 0) {
+      if (true) {
         console.log("record exist status",noRecord);
         

[Survived] BooleanLiteral
src/pages/Search.jsx:55:21
       if (alumniData && arr.length !== 0) {
         console.log("record exist status",noRecord);
         
-        setNoRecord(false);
+        setNoRecord(true);
         setShow(true);
       } else {

[Survived] BooleanLiteral
src/pages/Search.jsx:56:17
         console.log("record exist status",noRecord);
         
         setNoRecord(false);
-        setShow(true);
+        setShow(false);
       } else {
         setNoRecord(true);

[Survived] BlockStatement
src/pages/Search.jsx:57:14
         
         setNoRecord(false);
         setShow(true);
-      } else {
-        setNoRecord(true);
-        console.log("No record Exist status",noRecord);
-        console.log("Alu Data",alumniData)
-      }
+      } else {}
     }catch (error) {
       console.error('Error fetching data:', error.message);

[Survived] BooleanLiteral
src/pages/Search.jsx:58:21
         setNoRecord(false);
         setShow(true);
       } else {
-        setNoRecord(true);
+        setNoRecord(false);
         console.log("No record Exist status",noRecord);
         console.log("Alu Data",alumniData)

[Survived] BlockStatement
src/pages/Search.jsx:62:20
         console.log("No record Exist status",noRecord);
         console.log("Alu Data",alumniData)
       }
-    }catch (error) {
-      console.error('Error fetching data:', error.message);
-      // Handle specific error cases, if needed
-    }
+    }catch (error) {}
   };
   

[Survived] BlockStatement
src/pages/Search.jsx:69:42
   };
   
 
-  const handleRegister = (student_id) => {
-    setRegister(true);
-    setShow(false);
-    setNoRecord(false);
-    setPropertyVal(student_id);
-    // You can navigate to the Contact component or any other page as needed
-    //navigate(`/contact/${student_id}`);
-    setShowContactForm(!showContactForm);
-    window.localStorage.setItem('studentId', student_id);
-  };
+  const handleRegister = (student_id) => {};
 
   // const toggleUML = () => {

[Survived] BooleanLiteral
src/pages/Search.jsx:70:17
   
 
   const handleRegister = (student_id) => {
-    setRegister(true);
+    setRegister(false);
     setShow(false);
     setNoRecord(false);

[Survived] BooleanLiteral
src/pages/Search.jsx:71:13
 
   const handleRegister = (student_id) => {
     setRegister(true);
-    setShow(false);
+    setShow(true);
     setNoRecord(false);
     setPropertyVal(student_id);

[Survived] BooleanLiteral
src/pages/Search.jsx:72:17
   const handleRegister = (student_id) => {
     setRegister(true);
     setShow(false);
-    setNoRecord(false);
+    setNoRecord(true);
     setPropertyVal(student_id);
     // You can navigate to the Contact component or any other page as needed

[Survived] BooleanLiteral
src/pages/Search.jsx:76:24
     setPropertyVal(student_id);
     // You can navigate to the Contact component or any other page as needed
     //navigate(`/contact/${student_id}`);
-    setShowContactForm(!showContactForm);
+    setShowContactForm(showContactForm);
     window.localStorage.setItem('studentId', student_id);
   };

[Survived] LogicalOperator
src/pages/Search.jsx:86:8
 
   return (
     <div>
-      {!showContactForm && (
-      <Form className="main_form">
-        <Form.Group className="mb-3" controlid="g_year">
-          <Form.Label>Graduation Year</Form.Label>
-          <Form.Control type="number" placeholder="Enter Graduation Year" onChange={handleChangeGYear} value={grad_year} />
-          <Form.Text className="text-muted custom-text">Thank you for being a part of IIITB Fam..!</Form.Text>
-        </Form.Group>
-
-        <Form.Group className="mb-3" controlid="fname">
-          <Form.Label>First Name</Form.Label>
-          <Form.Control type="text" placeholder="Enter First Name" onChange={handleChangeFName} value={fname} />
-        </Form.Group>
-
-        <Button className="mb-3" controlid="search_button" variant="primary" onClick={getAlumniDetails}>
-          Search
-        </Button>
-        <br />
-
-        {noRecord ? (
-          <Form.Text className="text-muted">Sorry no record found in IIITB's Database please try again..!</Form.Text>
-        ) : null}
-      </Form>
-      )}
+      {!showContactForm || <Form className="main_form">
+        <Form.Group className="mb-3" controlid="g_year">
+          <Form.Label>Graduation Year</Form.Label>
+          <Form.Control type="number" placeholder="Enter Graduation Year" onChange={handleChangeGYear} value={grad_year} />
+          <Form.Text className="text-muted custom-text">Thank you for being a part of IIITB Fam..!</Form.Text>
+        </Form.Group>
+
+        <Form.Group className="mb-3" controlid="fname">
+          <Form.Label>First Name</Form.Label>
+          <Form.Control type="text" placeholder="Enter First Name" onChange={handleChangeFName} value={fname} />
+        </Form.Group>
+
+        <Button className="mb-3" controlid="search_button" variant="primary" onClick={getAlumniDetails}>
+          Search
+        </Button>
+        <br />
+
+        {noRecord ? <Form.Text className="text-muted">Sorry no record found in IIITB's Database please try again..!</Form.Text> : null}
+      </Form>}
       {showContactForm && <Contact />}
 

[Survived] ConditionalExpression
src/pages/Search.jsx:86:8
 
   return (
     <div>
-      {!showContactForm && (
-      <Form className="main_form">
-        <Form.Group className="mb-3" controlid="g_year">
-          <Form.Label>Graduation Year</Form.Label>
-          <Form.Control type="number" placeholder="Enter Graduation Year" onChange={handleChangeGYear} value={grad_year} />
-          <Form.Text className="text-muted custom-text">Thank you for being a part of IIITB Fam..!</Form.Text>
-        </Form.Group>
-
-        <Form.Group className="mb-3" controlid="fname">
-          <Form.Label>First Name</Form.Label>
-          <Form.Control type="text" placeholder="Enter First Name" onChange={handleChangeFName} value={fname} />
-        </Form.Group>
-
-        <Button className="mb-3" controlid="search_button" variant="primary" onClick={getAlumniDetails}>
-          Search
-        </Button>
-        <br />
-
-        {noRecord ? (
-          <Form.Text className="text-muted">Sorry no record found in IIITB's Database please try again..!</Form.Text>
-        ) : null}
-      </Form>
-      )}
+      {true}
       {showContactForm && <Contact />}
 

[Survived] LogicalOperator
src/pages/Search.jsx:109:8
         ) : null}
       </Form>
       )}
-      {showContactForm && <Contact />}
+      {showContactForm || <Contact />}
 
       {show && alumniData.length !== 0 ? (

[Survived] ConditionalExpression
src/pages/Search.jsx:109:8
         ) : null}
       </Form>
       )}
-      {showContactForm && <Contact />}
+      {true}
 
       {show && alumniData.length !== 0 ? (

[Survived] LogicalOperator
src/pages/Search.jsx:111:8
       )}
       {showContactForm && <Contact />}
 
-      {show && alumniData.length !== 0 ? (
+      {show || alumniData.length !== 0 ? (
         <table className="alumniSearch">
           <thead>

[Survived] EqualityOperator
src/pages/Search.jsx:111:16
       )}
       {showContactForm && <Contact />}
 
-      {show && alumniData.length !== 0 ? (
+      {show && alumniData.length === 0 ? (
         <table className="alumniSearch">
           <thead>

[Survived] ArrowFunction
src/pages/Search.jsx:123:29
             </tr>
           </thead>
           <tbody>
-            {alumniData.map((alumni) => (
-              <tr key={alumni.student_id}>
-                <td>{alumni.name}</td>
-                <td> {alumni.student_id} </td>
-                <td>{alumni.graduation_year}</td>
-                <td>{alumni.roll_no}</td>
-                <td>
-                  <Button onClick={() => handleRegister(alumni.student_id)}>CLICK</Button>
-                </td>
-              </tr>
-            ))}
+            {alumniData.map(() => undefined)}
           </tbody>
         </table>

[Survived] ArrowFunction
src/pages/Search.jsx:130:36
                 <td>{alumni.graduation_year}</td>
                 <td>{alumni.roll_no}</td>
                 <td>
-                  <Button onClick={() => handleRegister(alumni.student_id)}>CLICK</Button>
+                  <Button onClick={() => undefined}>CLICK</Button>
                 </td>
               </tr>
